SELECT
    event.id,
    event.description,
    event.price,
    event.people,
    event.spend_time,
    IFNULL (tmp_star.count, 0) AS star,
    tmp_tag.tags
FROM
    event
    LEFT JOIN (
        SELECT
            event_id,
            COUNT(*) AS count
        FROM
            star
        GROUP BY
            event_id
    ) AS tmp_star ON event.id = tmp_star.event_id
    LEFT JOIN (
        SELECT
            et.event_id AS event_id,
            JSON_ARRAYAGG(
                JSON_OBJECT('id', t.id, 'word', t.word)
            ) AS tags
        FROM
            event_tag et
        INNER JOIN tag t ON et.tag_id = t.id
        GROUP BY et.event_id
    ) AS tmp_tag ON event.id = tmp_tag.event_id
    ORDER BY star DESC;


+----+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------+--------+------------+------+-------------------------------------------------------------------------------------------------------------------------------------------------+
| id | description                                                                                                                                                                                                                 | price  | people | spend_time | star | tags                                                                                                                                            |
+----+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------+--------+------------+------+-------------------------------------------------------------------------------------------------------------------------------------------------+
|  1 | 大富豪とダウトを組み合わせたトランプゲームです。少人数でも楽しめるように大富豪を改変しました。                                                                                                                              |    200 |      3 |         10 |    9 | [{"id": 2, "word": "ゲーム"}, {"id": 5, "word": "飲み会"}, {"id": 1, "word": "レク"}]                                                           |
|  2 | 新入生と現部員の交流を目的として、大学内のテラスでBBQを行いました。                                                                                                                                                         | 100000 |     40 |        300 |   10 | [{"id": 3, "word": "BBQ"}, {"id": 4, "word": "キャンプ"}]                                                                                       |
|  3 | 大学祭で模擬店を出店しました。唐揚げやたこ焼きを中心とした揚げ物に加えて、飲み物を販売しました。                                                                                                                            | 150000 |     12 |       6000 |    1 | [{"id": 6, "word": "学祭"}]                                                                                                                     |
|  4 | サークル勧誘を目的としたボーリング大会を行いました。                                                                                                                                                                        |  20000 |     32 |        120 |    0 | [{"id": 5, "word": "飲み会"}, {"id": 15, "word": "焼肉"}, {"id": 14, "word": "ボーリング"}, {"id": 13, "word": "新入生歓迎会"}]                 |
|  5 |  大学祭後に大学祭の模擬店でスタッフとして働いてくれた部員の子たちと焼肉を食べに行きました。                                                                                                                                 |  50000 |     40 |        360 |    0 | [{"id": 14, "word": "ボーリング"}, {"id": 15, "word": "焼肉"}, {"id": 5, "word": "飲み会"}]                                                     |
|  6 | 冬休み前最後の授業日にクリスマス会、忘年会、新年会を含めたレクリエーション大会を行いました。                                                                                                                                |   5000 |      7 |         30 |    0 | [{"id": 16, "word": "クリスマス"}, {"id": 11, "word": "忘年会"}, {"id": 12, "word": "新年会"}]                                                  |
|  7 | 前期期末テストが終わり、夏休みが始まる前に「前期お疲れ様です！」ということでビンゴ大会を行いました。みんなが欲しがるような豪華景品を用意しました。                                                                          | 500000 |    100 |       2400 |    1 | [{"id": 1, "word": "レク"}, {"id": 2, "word": "ゲーム"}, {"id": 13, "word": "新入生歓迎会"}]                                                    |
+----+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------+--------+------------+------+-------------------------------------------------------------------------------------------------------------------------------------------------+